### From pydataset import data and run SQL Commands:

In [8]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import os
from pydataset import data

In [9]:
engine1 = create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit")
engine1

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [10]:
mtcars = data('mtcars')

In [11]:
mtcars.to_sql(name='mtcars', con=engine1, if_exists='append', index=False)

32

In [12]:
pd.read_sql('SHOW DATABASES;', engine1)

             Database
0  information_schema
1  performance_schema
2                piit

In [13]:
pd.read_sql('SHOW TABLES;', engine1)

  Tables_in_piit
0       customer
1       employee
2         mtcars
3        netflix
4      students2

In [14]:
df = pd.read_sql("select * from mtcars;", engine1)
df.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

In [16]:
pd.read_sql("select * from mtcars where cyl=6;", engine1)

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
3  18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
4  19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
5  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
6  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6

In [17]:
pd.read_sql("select distinct gear from mtcars;", engine1)

   gear
0     4
1     3
2     5